<template>
  <v-app>
    <Header></Header>
    <v-main>
      <v-container>
        <p class="display-2 text-center">用户协议</p>
        <v-divider></v-divider>
        <br /><br />
        <div style="text-align: left">
          <p>
            请您仔细阅读以下条款，并确认您已完全理解本协议之规定，尤其是免除及限制责任的条款、法律适用及争议解决条款。
          </p>
          <p>
            若您对本声明或本协议任何条款有异议，请停止注册或使用POMO网所提供的全部服务。
          </p>
          <p>
            <strong>一、协议的接受、变更与补充</strong>
          </p>
          <p>
            1、勾选本协议前选项框并点击“注册”，将视为您签署了本协议，表明您自愿接受本协议全部条款的约束，
            本协议将构成您与“POMO”平台（以下统称“POMO”，包括相关关联方）之间具有约束力的法律文件。无论您是进入POMO浏览网页，
            还是在POMO上发布任何内容，或者是直接或通过各类方式（如站外API引用等）间接使用POMO网服务和数据的行为，都将被视作已无条件接受本声明所涉全部内容。
          </p>
          <p>
            2、POMO有权利对本协议进行修改，协议修改后，POMO将通过在相关页面公告或发送通知等方式公布修改的内容，
            修改后的协议一经公布即有效的代替原协议。如果您不同意本协议的修改，请立即停止访问或使用本网站或取消已经获得的服务；
            如果您选择继续访问或使用本网站，则视为您已接受本协议的修改。
          </p>
          <p>
            3、签署的本协议所列明的条款，并不能完全涵盖您与POMO之间所有的权利和义务。
            因此，POMO不定期公布的其他声明、规则等均视为本协议之补充协议，为本协议不可分割的组成部分，与本协议具有同等法律效力。
          </p>
          <p>
            4、如本协议与POMO平台其它协议条款不一致，以其它协议条款内容为准。
          </p>
          <p>二、账号密码与注册登录</p>
          <p>1、账号的取得</p>
          <p>
            (1)您确认，在您开始注册POMO前，已经具备中华人民共和国法律规定的与您行为相适应的民事行为能力。
            若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
          </p>
          <p>
            (2)您注册成功后，即成为POMO注册用户，用户须对在POMO的注册信息的真实性、合法性、有效性承担全部责任。
            您可自行创建、修改昵称，但用户名和昵称的命名及使用应遵守相关法律法规并符合网络道德，不得冒充他人或恶意注册使人误认；不得利用他人的名义发布任何信息；
            不得恶意使用注册帐号导致其他用户误认；用户名和昵称中不能含有任何侮辱、诽谤、淫秽或暴力等侵害他人合法权益或违反公序良俗的词语。
            如您违反前述规定，POMO有权随时限制或拒绝您使用该账号，甚至注销该账号。
          </p>
          <p>(3)用户名的管理</p>
          <p>1)请使用真实姓名进行注册</p>
          <p>2)请勿注册和使用与其他网友相同、相仿的用户名或昵称；</p>
          <p>
            3)用户以虚假信息骗取账号名称注册，或账号头像、简介等注册信息存在违法和不良信息的，POMO将暂停或注销。
          </p>
          <p>
            2、请您妥善保管您注册时填写的用户帐号和密码，不要将帐号密码告知他人，因用户原因导致帐号或密码泄露而造成的法律后果由用户负责。
            同时，用户还应当对以此帐号登录进行的所有活动和事件承担全部后果与法律责任。
          </p>
          <p>
            3、若您的帐号或密码遗失，可以通过注册信息按照相关步骤找回密码，若您发现账号遭到未授权的使用或存在其他安全漏洞的情况，应立即告知POMO。
          </p>
          <p>三、POMO服务的使用</p>
          <p>
            (1)您在使用本服务过程中，不得以任何方式利用POMO直接或间接从事违反中国法律、以及社会公德的行为，
            应当遵守尊重不同地区、地域的道德和风俗习惯，并且应避免因使用本服务而使POMO卷入政治和公共事件。
          </p>
          <p>
            (2)POMO有权对用户使用POMO的情况进行审查和监督，如用户在使用POMO时违反任何上述规定，
            POMO或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户发布的内容、暂停或终止用户使用POMO的权利）以减轻用户不当行为造成的影响。
          </p>
          <p>
            (3)用户违反上述规定并造成严重后果的，POMO除暂停或终止对您的服务，
            解除双方间的服务协议和法律关系外，无需退还您所支付的费用（如有），视为您支付的违约金，如违约金不足以弥补POMO的损失的，POMO还可通过其他法律途径向您追索。
          </p>
          <p>
            <strong>四、协议的生效与修改</strong>
          </p>
          <p>
            1、
            您进入POMO并使用POMO的服务即视为您已阅读本协议并接受本协议的约束。
          </p>
          <p>
            2、
            POMO有权在必要时修改本协议条款，您可以在相关服务页面查阅最新版本的协议条款。
          </p>
          <p>
            3、
            本协议条款变更后，如果您继续使用POMO提供的服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当退出POMO并停止使用POMO提供的服务。
          </p>
          <p>
            <strong>五、 服务的中止与终止</strong>
          </p>
          <p>
            1、
            POMO可能会对提供的服务内容进行不定时的变更，也可能会中断、中止或终止服务。
          </p>
          <p>
            2、
            如发生下列任何一种情形，POMO有权不经通知而中断或终止向您提供的服务：
          </p>
          <p>
            (1)
            根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；
          </p>
          <p>(2) 您涉嫌违反相关法律法规规定；</p>
          <p>(3) 按照法律规定或主管部门的要求；</p>
          <p>(4) 出于安全的原因或其他必要的情形；</p>
          <p>(5) 本协议中明确约定的其他情形。</p>
          <p>
            六
            <strong>、 法律适用与争议解决</strong>
          </p>
          <p>
            1、
            本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（仅为本合同之目的，不包括香港、台湾、澳门地区）。
          </p>
          <p>
            2、
            若您和POMO之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地人民法院管辖。
          </p>
          <br />
        </div>
      </v-container>
    </v-main>
    <Footer></Footer>
  </v-app>
</template>
<script>
export default {
  name: 'agreement',
  metaInfo: {
    title: '用户协议',
  },
  data() {
    return {
      dialog: false,
    };
  },
};
</script>
